In [1]:
import numpy as np
import pandas as pd

In [18]:
#pandas operations
#conditional selection
#access rows & columns
#add & delete columns
#concatenation, merging & joining dataframes
#handling missing values
#apply()

In [3]:
d={"USN":[100,101,102],
  "Name":["jerry","tom","ramesh"],
  "Mobile":[99,88,77],
  "Marks":[30,35,32]}

In [4]:
std=pd.DataFrame(d)

In [5]:
std

   USN    Name  Mobile  Marks
0  100   jerry      99     30
1  101     tom      88     35
2  102  ramesh      77     32

In [6]:
#dataframe operations
#head-displaing rows 
#method associated wth data frame
#display all by default
#parameter passed, display rows as per parameter
std.head()

   USN    Name  Mobile  Marks
0  100   jerry      99     30
1  101     tom      88     35
2  102  ramesh      77     32

In [7]:
std.head(2)

   USN   Name  Mobile  Marks
0  100  jerry      99     30
1  101    tom      88     35

In [12]:
std.info()
#give all the infromation about dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   Name    3 non-null      object
 2   Mobile  3 non-null      int64
 3   Marks   3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [13]:
std.columns
#list of columns in dataframe

Index(['USN', 'Name', 'Mobile', 'Marks'], dtype='object')

In [14]:
std.isnull()

     USN   Name  Mobile  Marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [15]:
#accessing columns
std["USN"]

0    100
1    101
2    102
Name: USN, dtype: int64

In [16]:
#accessing multiple columns
std[["USN","Marks"]]

   USN  Marks
0  100     30
1  101     35
2  102     32

In [17]:
#access rows
std.loc[1]
#returns row

USN       101
Name      tom
Mobile     88
Marks      35
Name: 1, dtype: object

In [35]:
#create a dataframe cars having the attributes carid , carename
D={"CarId":[1,2,3,4,5,6],
  "CarName":["a","b","c","d","e",None]}

In [36]:
std=pd.DataFrame(D)

In [37]:
std

   CarId CarName
0      1       a
1      2       b
2      3       c
3      4       d
4      5       e
5      6    None

In [38]:
std.isnull()

   CarId  CarName
0  False    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False     True

In [39]:
std.iloc[2]

CarId      3
CarName    c
Name: 2, dtype: object

In [48]:
d={"USN":[100,101,102],
  "Name":["jerry","tom","ramesh"],
  "Mobile":[99,88,77],
  "Marks":[30,35,None]}
std=pd.DataFrame(d)

In [49]:
std

   USN    Name  Mobile  Marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [50]:
index=["A","B","C"]
std.set_index("USN")
std

   USN    Name  Mobile  Marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [51]:
std.iloc[2]

USN          102
Name      ramesh
Mobile        77
Marks        NaN
Name: 2, dtype: object

In [53]:
#condition selection
std["Marks"]<35

0     True
1    False
2    False
Name: Marks, dtype: bool

In [56]:
newdf=std["Marks"]<35
std[newdf]

   USN   Name  Mobile  Marks
0  100  jerry      99   30.0

In [57]:
std[newdf]["Name"]

0    jerry
Name: Name, dtype: object

In [58]:
#multiple conditions
std[(std["Name"]=="jerry")
    &(std["Marks"]>20)]

   USN   Name  Mobile  Marks
0  100  jerry      99   30.0

In [59]:
std[(std["USN"]>100)|(std["Marks"]<40)]

   USN    Name  Mobile  Marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [60]:
std[(std["USN"]>100)&(std["Marks"]<40)]

   USN Name  Mobile  Marks
1  101  tom      88   35.0

In [61]:
#adding new column
s="banglore,delhi,kashmir".split(",")
print(s,type(s))

['banglore', 'delhi', 'kashmir'] <class 'list'>

In [62]:
std["Address"]=s
std

   USN    Name  Mobile  Marks   Address
0  100   jerry      99   30.0  banglore
1  101     tom      88   35.0     delhi
2  102  ramesh      77    NaN   kashmir

In [65]:
std.drop("Address",axis=1,inplace=True)

In [66]:
std

   USN    Name  Mobile  Marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [67]:
std.drop(2)

   USN   Name  Mobile  Marks
0  100  jerry      99   30.0
1  101    tom      88   35.0

In [69]:
std

   USN    Name  Mobile  Marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [ ]:
#dropna()
#fillna()

In [77]:
d={"USN":[100,101,102],
  "Name":["jerry","tom","ramesh"],
  "Mobile":[99,88,77],
  "Marks":[30,35,None]}
std=pd.DataFrame(d)

In [78]:
std

   USN    Name  Mobile  Marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [76]:
std.dropna() #delets row of missing values

   USN   Name  Mobile  Marks
0  100  jerry      99   30.0
1  101    tom      88   35.0

In [84]:
d1={"USN":[None,None,102],
  "Name":[None,None,"ramesh"],
  "Mobile":[99,88,77],
  "Marks":[30,35,None]}
std=pd.DataFrame(d1)

In [85]:
std

     USN    Name  Mobile  Marks
0    NaN    None      99   30.0
1    NaN    None      88   35.0
2  102.0  ramesh      77    NaN

In [86]:
std.dropna(thresh=2)

     USN    Name  Mobile  Marks
0    NaN    None      99   30.0
1    NaN    None      88   35.0
2  102.0  ramesh      77    NaN